#+title: Structure of the Tezos Context

* Tools

** tree_fold.ml

How much info can we get out with a ~Tree.fold~?

#+begin_src
node_count: 38_441_804
content_count: 79_822_881
content_total_size: 1_601_844_889
content_max_size: /data/contracts/index/01d36be45e8ace95d7dfe812929f64231ff46fcd3f00/data/storage 367707
content_min_size: /data/active_delegate_with_one_roll/current/ed25519/002fe7db5218a1d674c88dd9d9421ac60b8eb3e5 0
#+end_src

*** Size of Content is about 1.5 gibibyte

#+begin_src scheme
  (/ 1601844889.0 (expt 1024 3))
#+end_src

#+RESULTS:
: 1.4918343061581254

* Notes

** Probably large

Folding over the entire tree of a single context takes around 13 minutes:

#+begin_src ocaml
  Store.Tree.fold tree ()
#+end_src


